000100 program-id. COMCAAS as "COMCAAS".
000200* WRITTEN BY AARON SEAVERS
000300* ASK USER FOR THE NUMBER OF UNITS SOLD AND THE UNIT PRICE.
000400* DISPLAY THE PRICE AND UNITS ENTERED. 
000500* CALCULATE THE GROSS SALES AMOUNT (UNITS X PRICE).  
000600* DISPLAY GROSS SALES.
000700* CALCULATE THE COMMISSION (GROSS * COMM-RATE).
000800* DISPLAY THE COMMISSION.
000900* CALCULATE THE NET PROFIT FOR THE ITEM 
001000 
001100 DATA DIVISION.
001200 WORKING-STORAGE SECTION.
001300  
001400 01  WS-TODAYS-DATE          pic x(08).
001500 01  WS-TIME                 PIC 9(08).
001600 01  WS-END                  pic X(01).
001700 
001800 01  WS-UNITS-IN             PIC X(03). 
001900 01  WS-UNITS-NUMERIC        PIC 9(03).
002000 
002100 01  WS-UNIT-RATE-IN.
002200     05 WS-UNIT-RATE-DOLLARS  PIC X(03).
002300     05 WS-UNIT-RATE-DECIMAL  PIC X.
002400     05 WS-UNIT-RATE-CENTS    PIC XX.
002500 
002600 01  WS-NUMERIC-UNIT-PARTS.
002700     05 WS-NUMERIC-UNIT-DOLLARS 
002800                              PIC 9(03).
002900     05 WS-NUMERIC-UNIT-CENTS PIC 9(02).
003000 01  WS-NUMERIC-UNIT-WHOLE    PIC 9(03)V9(02).         
003100 
003200 01  WS-COMM-RATE            PIC 9V9(02)     VALUE .09.
003300
003400 01  WS-GROSS-AMOUNT         PIC 9(08)V99  VALUE 0.
003500 01  WS-COMM-AMOUNT          PIC 9(08)V99  VALUE 0.
003600 01  WS-NET-PROFIT           PIC 9(06)V99 VALUE 0.
003700
003800
003900
004000 01  WS-FORMATTED-AMOUNT-Z   PIC ZZZZZZZZZZZ9.99.
004100 01  WS-FORMATTED-AMOUNT     PIC $ZZZZZZZZZZ9.99.       
004200 01  WS-FORMATTED-UNITS      PIC ZZZZZZZZZZZZZ9.
004300 
004400 PROCEDURE DIVISION.
004500 0000-MAINLINE.
004600     
004700     DISPLAY 'START COMMCAAS BY AARON SEAVERS'.
004800     perform 1000-get-date-time.
004900  
005000* PROMPT THE USER FOR RATE UNTIL NUMERIC RATE ENTERED:
005100
005200     PERFORM UNTIL WS-UNIT-RATE-DOLLARS IS numeric
005300         AND WS-UNIT-RATE-CENTS IS NUMERIC
005400               AND WS-UNIT-RATE-DECIMAL = '.'
005500 DISPLAY "ENTER THE UNIT PRICE FROM 000.00 TO 999.99"
005600               " AND PRESS ENTER"
005700       ACCEPT WS-UNIT-RATE-IN
005800     END-PERFORM
005900     
006000* PROMPT THE USER FOR UNITS UNTIL NUMERIC UNITS ENTERED:          
006100     PERFORM UNTIL WS-UNITS-IN IS NUMERIC
006200       DISPLAY "ENTER THE UNITS SOLD FROM 000 TO 999"
006300               " AND PRESS ENTER"
006400       ACCEPT WS-UNITS-IN
006500     END-PERFORM
006600
006700* CONVERT THE STRING DATA ENTERED INTO NUMERIC FIELD:
006800   MOVE WS-UNITS-IN TO WS-UNITS-NUMERIC.
006900   MOVE WS-UNIT-RATE-DOLLARS TO WS-NUMERIC-UNIT-DOLLARS.  
007000   MOVE WS-UNIT-RATE-CENTS TO WS-NUMERIC-UNIT-CENTS.
007100   MOVE WS-NUMERIC-UNIT-PARTS TO WS-NUMERIC-UNIT-WHOLE.
007200     display "______________________________".
007300     
007400* FORMAT UNITS IN AND DISPLAY:
007500     move WS-UNITS-NUMERIC TO WS-FORMATTED-UNITS.
007600     display "UNITS SOLD   :  "WS-FORMATTED-UNITS.
007700     
007800* FORMAT AND DISPLAY UNIT PRICE:            
007900     MOVE WS-NUMERIC-UNIT-WHOLE TO WS-FORMATTED-AMOUNT.
008000     DISPLAY "RATE ENTERED : "WS-FORMATTED-AMOUNT.
008100  
008200* COMPUTE, FORMAT AND DISPLAY GROSS SALES:             
008300     COMPUTE WS-GROSS-AMOUNT =
008400       WS-NUMERIC-UNIT-WHOLE * WS-UNITS-NUMERIC.
008500     
008600     MOVE WS-GROSS-AMOUNT   TO WS-FORMATTED-AMOUNT-Z.
008700     DISPLAY "GROSS SALES  : " WS-FORMATTED-AMOUNT-Z.  
008800     
008900* COMPUTE, FORMAT AND DISPLAY COMMISSION:             
009000     COMPUTE WS-COMM-AMOUNT =
009100       WS-GROSS-AMOUNT * WS-COMM-RATE.
009200                                  
009300     MOVE WS-COMM-AMOUNT   TO  WS-FORMATTED-AMOUNT-Z.
009400     DISPLAY "COMMISSION   : " WS-FORMATTED-AMOUNT-Z.
009500    
009600* COMPUTE, FORMAT AND DISPLAY NET PROFIT:          
009700     COMPUTE WS-NET-PROFIT = WS-GROSS-AMOUNT -
009800                             WS-COMM-AMOUNT.
009900     MOVE    WS-NET-PROFIT TO WS-FORMATTED-AMOUNT.
010000     DISPLAY "PROFIT AMOUNT: " WS-FORMATTED-AMOUNT.
010100     
010200     display "______________________________".           
010300     DISPLAY "PROGRAM ENDS".
010400     perform 1000-get-date-time.
010500     
010600     accept WS-END.
010700     GOBACK.
010800 
010900 1000-get-date-time.
011000     ACCEPT WS-TODAYS-DATE from date yyyymmdd.
011100     ACCEPT WS-TIME        from time.
011200     DISPLAY " ON DATE: " WS-TODAYS-DATE
011300             " AT: " WS-TIME.
