       IDENTIFICATION DIVISION.
       PROGRAM-ID. FirstAS.

       PROCEDURE DIVISION.
           displayprompt.
           display "Aaron Seavers Completed the First Program".
           goback.
           
       end program FirstAS.
